# Public School SATs

Public School SAT

![New York City schoolbus](schoolbus.jpg)

Photo by [Jannis Lucas](https://unsplash.com/@jannis_lucas) on [Unsplash](https://unsplash.com).
<br>

Every year, American high school students take SATs, which are standardized tests intended to measure literacy, numeracy, and writing skills. There are three sections - reading, math, and writing, each with a **maximum score of 800 points**. These tests are extremely important for students and colleges, as they play a pivotal role in the admissions process.

Analyzing the performance of schools is important for a variety of stakeholders, including policy and education professionals, researchers, government, and even parents considering which school their children should attend. 

You have been provided with a dataset called `schools.csv`, which is previewed below.

You have been tasked with answering three key questions about New York City (NYC) public school SAT performance.

In [87]:
# Re-run this cell 
import pandas as pd

# Read in the data
schools = pd.read_csv("schools.csv")

# Preview the data
schools.head()

# Start coding here...
# Add as many cells as you like...

                                         school_name  ... percent_tested
0  New Explorations into Science, Technology and ...  ...            NaN
1                               Essex Street Academy  ...           78.9
2                       Lower Manhattan Arts Academy  ...           65.1
3    High School for Dual Language and Asian Studies  ...           95.9
4      Henry Street School for International Studies  ...           59.7

[5 rows x 7 columns]

In [88]:
schools.shape

(375, 7)

In [89]:
schools.columns

Index(['school_name', 'borough', 'building_code', 'average_math',
       'average_reading', 'average_writing', 'percent_tested'],
      dtype='object')

In [90]:
schools['borough'].unique()

array(['Manhattan', 'Staten Island', 'Bronx', 'Queens', 'Brooklyn'],
      dtype=object)

Best math schools

In [91]:
best_math_thresh = 800 * 0.8

In [92]:
df = schools[schools['average_math'] > best_math_thresh]

In [93]:
df.head()

                                          school_name  ... percent_tested
0   New Explorations into Science, Technology and ...  ...            NaN
45                      Eleanor Roosevelt High School  ...           86.0
68  High School for Mathematics, Science, and Engi...  ...           92.6
88                             Stuyvesant High School  ...           97.4
93                Staten Island Technical High School  ...           99.7

[5 rows x 7 columns]

In [94]:
df = df.sort_values(by='average_math', ascending = False)

In [95]:
best_math_schools = df[['school_name', 'average_math']]

In [96]:
best_math_schools

                                           school_name  average_math
88                              Stuyvesant High School           754
170                       Bronx High School of Science           714
93                 Staten Island Technical High School           711
365  Queens High School for the Sciences at York Co...           701
68   High School for Mathematics, Science, and Engi...           683
280                     Brooklyn Technical High School           682
333                        Townsend Harris High School           680
174  High School of American Studies at Lehman College           669
0    New Explorations into Science, Technology and ...           657
45                       Eleanor Roosevelt High School           641

Top ten schools

In [97]:
schools['total_SAT'] = schools['average_math'] + schools['average_reading']+ schools['average_writing']

In [98]:
schools.head(5)

                                         school_name  ... total_SAT
0  New Explorations into Science, Technology and ...  ...      1859
1                               Essex Street Academy  ...      1193
2                       Lower Manhattan Arts Academy  ...      1261
3    High School for Dual Language and Asian Studies  ...      1529
4      Henry Street School for International Studies  ...      1197

[5 rows x 8 columns]

In [99]:
df_x = schools.sort_values(by='total_SAT', ascending = False)

In [100]:
top_10_schools = df_x[['school_name', 'total_SAT']].head(10)

In [101]:
top_10_schools

                                           school_name  total_SAT
88                              Stuyvesant High School       2144
170                       Bronx High School of Science       2041
93                 Staten Island Technical High School       2041
174  High School of American Studies at Lehman College       2013
333                        Townsend Harris High School       1981
365  Queens High School for the Sciences at York Co...       1947
5                       Bard High School Early College       1914
280                     Brooklyn Technical High School       1896
45                       Eleanor Roosevelt High School       1889
68   High School for Mathematics, Science, and Engi...       1889

Borough comparison

In [102]:
import numpy as np

In [103]:
df_y = schools.groupby('borough')['total_SAT'].agg([np.mean, np.std])

In [104]:
df_y = df_y.reset_index()

In [105]:
df_y1 = df_y.sort_values(by='std', ascending = False).head(1)

In [106]:
df_y1

     borough         mean        std
2  Manhattan  1340.134831  230.29414

In [107]:
largest_std_dev = pd.DataFrame(columns=['borough','num_schools','average_SAT','std_SAT'])

In [108]:
largest_std_dev.columns

Index(['borough', 'num_schools', 'average_SAT', 'std_SAT'], dtype='object')

In [109]:
largest_std_dev = df_y1

In [110]:
largest_std_dev

     borough         mean        std
2  Manhattan  1340.134831  230.29414

In [111]:
largest_std_dev['num_schools'] = len(schools[schools['borough']=='Manhattan'])

In [112]:
largest_std_dev

     borough         mean        std  num_schools
2  Manhattan  1340.134831  230.29414           89

In [113]:
largest_std_dev.rename(columns = {'mean':'average_SAT', 'std':'std_SAT'}, inplace = True)

In [114]:
largest_std_dev = largest_std_dev.round({'average_SAT': 2, 'std_SAT': 2})

In [115]:
largest_std_dev

     borough  average_SAT  std_SAT  num_schools
2  Manhattan      1340.13   230.29           89